In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('data/friend_list.csv')

In [4]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
df.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [7]:
df = pd.read_csv('data/friend_list.txt')

In [8]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [9]:
df = pd.read_csv('data/friend_list_tab.txt')

In [10]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [13]:
df = pd.read_csv('data/friend_list_tab.txt',delimiter='\t')

In [14]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [15]:
df = pd.read_csv('data/friend_list_no_head.csv',header=None)

In [16]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [17]:
df.columns = ['name','age','job']

In [18]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [19]:
df = pd.read_csv('data/friend_list_no_head.csv',header=None , names=['name','age','job'])

In [20]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [40]:
friend_dict_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'},
    {'name' : 'Jenny', 'age' : 30, 'job' : 'developer'}
]

In [41]:
df = pd.DataFrame(friend_dict_list)

In [28]:
df.head()

    name age        job
0   John  25    student
1   Nate  30    teacher
2  Jenny  30  developer

In [29]:
df.to_csv('friends.csv', index = True, header =True)

In [30]:
df[1:3]

    name age        job
1   Nate  30    teacher
2  Jenny  30  developer

In [32]:
df. loc[[0,2]]

    name age        job
0   John  25    student
2  Jenny  30  developer

by column condition

In [42]:
df[df.age > 25]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [43]:
df[(df.age > 25) & (df.name =='Nate')]

   name  age      job
1  Nate   30  teacher

Filter Column

by index

In [44]:
friend_list = [
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',30,'teacher']
]

In [46]:
df = pd.DataFrame(friend_list)

In [47]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [50]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

by column name

In [51]:
df = pd.read_csv('data/friend_list_no_head.csv',header=None , names=['name','age','job'])

In [52]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [53]:
df_filtered = df[['name','job']]

In [55]:
df_filtered

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher
3  Julia    dentist
4  Brian    manager
5  Chris     intern

In [56]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [57]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [58]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [59]:
df.filter(regex='e$', axis =1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [60]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [61]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [62]:
df.drop(['John','Nate'])

       age        job
Jenny   30  developer

In [63]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [64]:
df.drop(['John','Nate'], inplace = True)

In [65]:
df

       age        job
Jenny   30  developer

In [66]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [67]:
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [69]:
df.drop(df.index[[0,2]])

    name  age        job
1  Jenny   30  developer

In [70]:
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [71]:
df = df[df.age > 20]

In [72]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [73]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [74]:
df.drop('age', axis = 1)

    name        job
0   Jone    student
1  Jenny  developer
2   Nate    teacher

In [76]:
df['salary'] = 0

In [77]:
df

    name  age        job  salary
0   Jone   20    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [78]:
import numpy as np

In [79]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [80]:
df

    name  age        job salary
0   Jone   20    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [81]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [82]:
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [83]:
df['total'] = df['midterm'] + df['final']

In [84]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [85]:
df['average'] = df['total'] /2

In [86]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [90]:
grades = []
for row in df['average']:
    if row >= 90:
        grades.append('A') 
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')

In [91]:
df['grade'] = grades

In [92]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

In [93]:
def pass_or_fail(row) :
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

In [94]:
df.grade = df.grade.apply(pass_or_fail)

In [95]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

In [96]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [97]:
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [98]:
def extract_year(row) :
    return row.split('-')[0]

In [99]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [100]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [101]:
df2 = pd.DataFrame([['Ben', 50,50]], columns = ['name', 'midterm', 'final'])

In [102]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [103]:
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [104]:
df.append(df2, ignore_index=True)

C:\Users\anyone\AppData\Local\Temp\ipykernel_16244\26416246.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50

In [105]:

student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])

In [106]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [107]:
groupby_major = df.groupby('major')

In [111]:
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [113]:
for name, group in groupby_major:
    print(name + ":" + str(len(group)))
    print(group)
    print()

Computer Science:4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics:3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics:1
      name    major   sex
2  Abraham  Physics  male

Psychology:3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [116]:
df_major_cnt = pd.DataFrame({'count' : groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [117]:
groupby_sex = df.groupby('sex')

In [118]:
for name, group in groupby_sex:
    print(name + ":" + str(len(group)))
    print(group)
    print()

female:6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male:5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [122]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [124]:
def extract_year(row) :
    return row.split('-')[0]

In [125]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [126]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [128]:
def get_age(year, current_year):
    return current_year - int(year)

In [129]:
df['age'] = df['year'].apply(get_age, current_year=2018)

In [130]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13